package chapter10;

public class Task_10_1 {
	/*
	 * Напишите класс, который генерирует и выводит на экран случайное 
целое чисел из диапазона положительных двузначных чисел.
	 */

	public static void main(String[] args) {
		
		int a = (int)(100*Math.random());
		
		System.out.println(a);

	}

}
