package chapter9;

public class Task_9_3 {
	/*
 Запиши в форме, принятой в языке Java, следующие условия, выра­
женные в таблице в словесной форме. 

Значение переменной больше 90, но мень-
ше 100 
// ( 90 < a <100 )
 
Сумма значений двух переменных больше 
100, но не превышает 200 
// (100 < (a+b) < 200 )

Значение переменной делится (без остат-
ка) и на 3, и на 4
// ( (a%3 == 0) & (a%4 == 0) )

Значение переменной - четное, но не за-
канчивается на О 
// ( (a%2 == 0) & (a%10 != 0) )

Значение переменной делится на 3, но не 
делится на 4
// ( (a%3 == 0) & (a%4 != 0) ) 

Значение переменной делится на 5 с ос-
татком 2, а на 3 делится с остатком 1 
// ( (a%5 == 2) & (a%3 == 1) ) 

Одна из цифр двузначного целого числа 
(значения переменной) равна 3 
// ( (a/100 == 3) || (a%10 == 3) )

Значение переменной представляет собой 
«правильную» оценку 
// ( (a==1) || (a==2) || (a==3) || (a==4) || (a==5) )

Ученик получил как минимум 4 и по анг-
лийскому, и по математике 
// ( (scoreEng >= 4) & (scoreMath >= 4) )  
	 */

	public static void main(String[] args) {
		

	}

}
