package chapter8;

public class Task_8_5 {

		/**

		Даны несколько словесных описаний оператора выбора. Для каждого 
		из них напишите оператор выбора на языке Java. 

		1. Если значение переменной х - положительное число, вывести на 
		экран сообщение Плюс, иначе - вывести на экран сообщение Не 
		плюс. 
		if (x>0) 
			System.out.println("Плюс");
		else 
			System.out.println("Минус");

		2. Если значение переменной х больше значения переменной а, пе-
		ременная а получает значение -1, иначе - переменная а получает 
		значение О. 
		if (x>a) 
			 a--;
		else 
			 a=0;

		3. Если значение переменной а больше 100, вывести на экран сообще-
		ние Верное число, иначе - вывести на экран сообщение Ошибка. 
		if (a>100) 
			System.out.println("Верное число");
		else 
			System.out.println("Ошибка");

		4. Если значения переменных а и х - не одинаковы, переменная а 
		получает значение переменной х, иначе - переменная х получает 
		удвоенное значение переменной а. 
		if (x != a) 
			 a=x;
		else 
			 x=2*a;

		5. Если переменная х содержит положительное значение, увеличить 
		ее значение на 1, иначе - уменьшить ее значение на 1. 
		if (x>0) 
			 x++;
		else 
			 x--;

		*/

}


