package chapter16;

public class Task_16_1 {
	/*
	 * 
С помощью таблицы трассировки проследите за выполнением фраг­
мента и запишите, что будет выведено на экран. 

   | i= | j= |(i+j)= | Вывод
 1 | 0  | 0  | 0     | 0
 2 | 0  | 1  | 1     | 1
 3 | 0  | 2  | 2     | 2
 4 | 0  | 3  | 3     | 3
 5 | 0  | 4  | 4     | 4
 6 | 1  | 0  | 1     | 1
 7 | 1  | 1  | 2     | 2
 8 | 1  | 2  | 3     | 3
 9 | 1  | 3  | 4     | 4
 10| 1  | 4  | 5     | 5
 11| 2  | 0  | 2     | 2
 12| 2  | 1  | 3     | 3
 13| 2  | 2  | 4     | 4
 14| 2  | 3  | 5     | 5
 15| 2  | 4  | 6     | 6
 16| 3  | 0  | 3     | 3
 17| 3  | 1  | 4     | 4
 18| 3  | 2  | 5     | 5
 19| 3  | 3  | 6     | 6
 20| 3  | 4  | 7     | 7
	 */

	public static void main(String[] args) {

		for (int i=0; i<4; i++) 
			for (int j=0; j<5; j++) 
				System.out.print (i+j); 
	}

}
